nc: 1

backbone:
  - [-1, 1, Conv, [16, 3, 2]]
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, C3k2, [64, False, 0.25]]
  - [-1, 1, SwinTinyLayer, [64, 4, 7, 0]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, C3k2, [128, False, 0.25]]
  - [-1, 1, SwinTinyLayer, [128, 4, 7, 3]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, C3k2, [128, True]]
  - [-1, 1, SwinTinyLayer, [128, 4, 7, 0]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, C3k2, [256, True]]
  - [-1, 1, SwinTinyLayer, [256, 8, 7, 3]]
  - [-1, 1, SPPF, [256, 5]]
  - [-1, 1, C2PSA, [256]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C3k2, [128, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C3k2, [64, False]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 1, C3k2, [128, False]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 1, C3k2, [256, True]]
  - [20, 1, KANC3k2, [64, 2, True, 0.5]]
  - [23, 1, KANC3k2, [128, 2, True, 0.5]]
  - [26, 1, KANC3k2, [256, 2, True, 0.5]]
  - [[27, 28, 29], 1, Detect, [nc]]
